In [ ]:
!pip install xml-to-df

In [1]:
import xml_to_df

In [2]:
xml_to_df.convert_xml_to_df('input.xml')

,book_category,book_title_lang,book_title,book_author,book_year,book_price,book_values_value_id,book_values_value,book_title_language,book_cricketers_cricketer1,book_cricketers_cricketer2,book_cricketers_country
0,COOKING,en,Everyday Italian,Giada De Laurentiis,2005,30.00,"[300, 100, 200]","[1, 5, 2]",NaN,NaN,NaN,NaN
1,CHILDREN,en,Harry Potter,J K. Rowling,2005,29.99,NaN,NaN,hello,Praveen,Pathan,"[india, india1]"
2,WEB,en,Learning XML,Erik T. Ray,2003,39.95,NaN,NaN,NaN,NaN,NaN,NaN